--START 准备施放技能或者开始读条 SUCCESS 施放成功 CREATE 制造物品成功 FAILED 技能施放失败
--SAY 白字喊话 YELL 红字喊话 GROUP 队伍喊话(团队/小队/副本队伍) WHISPER 密语 EMOTE 表情
--{'信息','频道'}为一个信息发送单位,单个信息{{'信息','频道'}},多个信息{{'信息1','频道1'},{'信息2','频道2'},{'信息n','频道n'}}
--战士
--圣骑士 Paladin
--死亡骑士 DeathKnight
--萨满祭司 Shaman
--猎人 Hunter
--德鲁伊 Druid
--潜行者 Rogue
--武僧 Monk
--术士 Warlock
--法师 Mage
--牧师
local JLib = LibStub:GetLibrary('JLib-1')
if not JLib then
	return
end
JLib.Msg = {
	['START'] = {
		--Paladin
		[7328] = {{'正在复活 %target , 其他奶妈请转火','GROUP', {'正在对你施放%spell','WHISPER'}}},--救赎
		--Druid
		[50769] = {{'正在复活 %target , 其他奶妈请转火','GROUP'}, {'正在对你施放%spell','WHISPER'}},--起死回生
		[20484] = {{'正在复活%target,其他奶妈请转火','GROUP'},{'正在对你施放%spell','WHISPER'}},--复生
		--Monk
		[115178] = {{'正在复活 %target , 其他奶妈请转火','GROUP'},{'正在对你施放 %spell ','WHISPER'}},--轮回转世
	},
	['SUCCESS'] = {
		--Paladin
		[31850] = {{'春哥啦，我好怕怕','SAY'}},--炽热防御者
		[642] = {{'圣光请庇佑我！','YELL'}},--圣盾术 110700
		[1022] = {{'%spell→%target','GROUP'},{'已经对你施放%spell','WHISPER'}},--保护之手
		[6940] = {{'%spell→%target','GROUP'},{'已经对你施放%spell','WHISPER'}},--牺牲之手
		[1044] = {{'%spell→%target','GROUP'},{'已经对你施放%spell','WHISPER'}},--自由之手
		[1038] = {{'%spell→%target','GROUP'},{'已经对你施放%spell','WHISPER'}},--拯救之手
		[31821] = {{'已经开启%spell', 'SAY'}},
		--ZS
		['剑刃风暴'] = {{'大风车吱呀吱哟哟地转，对面的敌人你快完蛋！','YELL'}},--剑刃风暴
		[107574] = {{'哥能变粗变大变黑，就问你怕不怕！','SAY'}},--天神下凡
		--DeathKnight
		[61999] = {{'%target，你这可耻的失败将警示所有巫妖王的仆从！你被诅咒了！站起来，重新执行%player的意志！','GROUP'}},--复活盟友
		[114556] = {{'信春哥，顶三秒','SAY'}},--炼狱
		--Druid
		[740] = {{'自然的力量听我调遣……','SAY'}},--宁静
		[50769] = {{'成功复活%target','GROUP'},{'快起来，不要躺地板了','WHISPER'}},--起死回生
		[20484] = {{'成功复活%target','GROUP'},{'已经 %spell ，请看情况起来','WHISPER'}},--复生
		[29166] = {{'已经对你施放%spell','WHISPER'}},
		['化身：生命之树'] = {{'树动王，变形出发！','SAY'}},--化身：生命之树
		['化身：艾露恩之眷'] = {{'出来吧，铁甲大咕咕！','SAY'}},--化身：艾露恩之眷
		[102543] = {{'我是丛林之王~','SAY'}},--化身：丛林之王
		[102558] = {{'你们看，我还有许多新招，比如变个巨熊','YELL'}},--化身：乌索克之子
		[110700] = {{'',''}},--共生->圣盾术
		--Monk
		[115178] = {{'正在试图复活%target','GROUP'},{'快起来，不要躺地板了','WHISPER'}},--轮回转世
		[115203] = {{'一杯%spell，奶妈别停手！','SAY'}},--壮胆酒
		[115078] = {{'葵花点穴手！','SAY'},{'%spell => %target','GROUP'}},--分筋错骨
		--Rogue
		[57934] = {{'已经对你施放%spell!持续6秒!伤害提高15%!','WHISPER'}},--嫁祸诀窍
		[1776] = {{'已对%target%spell','SAY'}},--凿击
		[6770] = {{'已对%target%spell','SAY'}},--闷棍
		[1766] = {{'%target，踢爆你!','SAY'}},--脚踢
		--Warlock
		[698] = {{'开电视啦速速来俩小伙伴搭把手啦','GROUP'}},--召唤仪式
		[29893] = {{'马桶已经就绪，要吃翔的小伙伴快来拿','GROUP'}},--制造灵魂之井
		[48020] = {{'瞬身术!','SAY'}},--恶魔法阵：传送
		[20707] = {{'吾以执掌灵魂之力命汝魂归来兮!>>%target<<!','GROUP'},{'如果当前还在战斗或者快要灭团，请不要立刻确定，看准时机再复活','WHISPER'}},--灵魂石
		[104773] = {{'%player已经施放%spell!请注意治疗!','SAY'}},--不灭决心
		--MS
		['消散'] = {{'朕已%spell!太医何在？','SAY'}},--消散
		['痛苦压制'] = {{'已对%target%spell','SAY'}},--痛苦压制
		--['光晕'] = {{'','SAY'}},--光晕
		--Mage
		[45438] = {{'啊……我的腰!','YELL'}},--寒冰屏障
		[61305] = {{'%spell ==> %target!','YELL'}},--变形术：黑猫
		[28271] = {{'%spell ==> %target!','YELL'}},--变形术：龟
		[118] = {{'%spell ==> %target!','YELL'}},--变形术：羊
		[80353] = {{'时间，是一张纠结的网……','SAY'}},--时间扭曲
		[108978] = {{'秘术·时间操控之术！','YELL'}},--操控时间
		[55342] = {{'秘术·多重影分身！','YELL'}},--镜像
		--Shaman
		[2825] = {{'嗜血已开~嗷嗷嗷！','GROUP'}},--嗜血
		--Hunter
		[34477] = {{'%spell ==> %target','SAY'}},--误导
		[121818] = {{'现在让我来告诉你们什么是数量优势','SAY'}},--群兽奔腾
		--种族
		--[69179]--'奥术洪流']= {{'%spell ==> %target!','SAY'}},
		--[88163] = {{'%spell ==> %target ==> %player','SAY'}} --自动攻击
	},
	['CREATE'] = {},
	['FAILED'] = {},
	['AURA_APPLIED'] = {
		--Druid
		[5487] = {{'你们看, 我还有许多新招, 比如变个熊','SAY'}},--熊形态
		--Mage
		--['幻觉'] = {{'秘法·变身术','SAY'}},--幻觉
		[87024] = {{'要死啦','SAY'},{'救命啊','SAY'},{'奶妈在哪里啊','SAY'}},--灸灼
	},
	['AURA_REMOVED'] = {
		--Mage
		[108978] = {{'秘术·时间操控之术·开!','YELL'}},--操控时间
		[80353] = {{'时之砂随风而逝!','SAY'}}--时间扭曲
	},
	['AURA_REFRESH'] = {}
}